In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    737     88   John  January      Q1
1  2023-01-02       B   West    860     56   Mary  January      Q1
2  2023-01-03       C  North    295     82    Bob  January      Q1
3  2023-01-04       D  South    571     36  Alice  January      Q1
4  2023-01-05       A   East    340     37   John  January      Q1
5  2023-01-06       B   West    475     35   Mary  January      Q1
6  2023-01-07       C  North    857     18    Bob  January      Q1
7  2023-01-08       D  South    139     78  Alice  January      Q1
8  2023-01-09       A   East    487     80   John  January      Q1
9  2023-01-10       B   West    103     71   Mary  January      Q1
10 2023-01-11       C  North    526     93    Bob  January      Q1
11 2023-01-12       D  South    357     26  Alice  January      Q1
12 2023-01-13       A   East    230     36   John  January      Q1
13 2023-01-14       B   West    255     59   Mary  January      Q1
14 2023-01-15       C  North    945     11    Bob  January      Q1
15 2023-01-16       D  South    411     24  Alice  January      Q1
16 2023-01-17       A   East    807     99   John  January      Q1
17 2023-01-18       B   West    687     62   Mary  January      Q1
18 2023-01-19       C  North    552     69    Bob  January      Q1
19 2023-01-20       D  South    654     47  Alice  January      Q1

In [4]:
pd.pivot_table(df, values= 'Sales', index= 'Region', columns= 'Product', aggfunc= 'median')

Product      A      B      C      D
Region
East     487.0    NaN    NaN    NaN
North      NaN    NaN  552.0    NaN
South      NaN    NaN    NaN  411.0
West       NaN  475.0    NaN    NaN

In [5]:

pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     520.2    NaN    NaN    NaN  68.0   NaN   NaN   NaN
North      NaN    NaN  635.0    NaN   NaN   NaN  54.6   NaN
South      NaN    NaN    NaN  426.4   NaN   NaN   NaN  42.2
West       NaN  476.0    NaN    NaN   NaN  56.6   NaN   NaN

# Cross Tabs

In [6]:

pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0